#include <stdio.h>

int main(void)
{
    int n;
    double num;
    double sum = 0;

    scanf("%d", &n);
    //根据片段：0.1出现4次，0.2出现6次，0.3出现6次，0.4出现4
    //发现规律：每个数都将与其后每个数均构成一个片段,
    //如0.2会产生(0.2), (0.2, 0.3),(0.2, 0.3, 0.4),
    //除此之外,它之前的每个数也都将与这些片段构成一个新片段,
    //比如0.2前有0.1,这个0.1会产生(0.1, 0.2),(0.1, 0.2, 0.3),(0.1, 0.2, 0.3, 0.4)
    //所以0.1出现的次数为其前面的数字的个数 * 其后的数字的个数加上它本身 
    //得到公式：数列中某个数出现的次数为它前面的数的个数 * (它后面的数的个数 + 1)
    for (int i = 0; i < n; ++i) {
        scanf("%lf", &num);
        //写成sum += (i + 1) * (n - i) * num会导致前面的乘法溢出
        sum += num * (i + 1) * (n - i);
    }

    printf("%.2f\n", sum);

    return 0;
}
